erik-elemind/monorepo/board/pin_mux.c
    const uint32_t EEG_LDO_EN = (/* Pin is configured as PIO2_7 */
                                 IOPCTL_PIO_FUNC0 |
                                 /* Disable pull-up / pull-down function */
                                 IOPCTL_PIO_PUPD_DI |
                                 /* Enable pull-down function */
                                 IOPCTL_PIO_PULLDOWN_EN |
                                 /* Disable input buffer function */
                                 IOPCTL_PIO_INBUF_DI |
                                 /* Normal mode */
                                 IOPCTL_PIO_SLEW_RATE_NORMAL |
                                 /* Normal drive */
                                 IOPCTL_PIO_FULLDRIVE_DI |
                                 /* Analog mux is disabled */
                                 IOPCTL_PIO_ANAMUX_DI |
                                 /* Pseudo Output Drain is disabled */
                                 IOPCTL_PIO_PSEDRAIN_DI |
                                 /* Input function is not inverted */
                                 IOPCTL_PIO_INV_DI);
    /* PORT2 PIN7 (coords: U16) is configured as PIO2_7 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITPINS_EEG_LDO_EN_PORT, BOARD_INITPINS_EEG_LDO_EN_PIN, EEG_LDO_EN);

    const uint32_t port2_pin8_config = (/* Pin is configured as PIO2_8 */
                                        IOPCTL_PIO_FUNC0 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_DI |
                                        /* Normal mode */
                                        IOPCTL_PIO_SLEW_RATE_NORMAL |
                                        /* Normal drive */
                                        IOPCTL_PIO_FULLDRIVE_DI |
                                        /* Analog mux is disabled */
                                        IOPCTL_PIO_ANAMUX_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI);
    /* PORT2 PIN8 (coords: U17) is configured as PIO2_8 */
    IOPCTL_PinMuxSet(IOPCTL, 2U, 8U, port2_pin8_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
